W4D1/FirstRoutes/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Homebody"], ["email", "iliketolayaround@verizon.net"], ["created_at", "2017-02-13 23:01:27.509457"], ["updated_at", "2017-02-13 23:01:27.509457"]]

  def update
    @user = User.find(params[:id])
    if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]
UPDATE "users" SET "name" = $1, "email" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "Uselessbody"], ["email", "nothingtodo@geocities.com"], ["updated_at", "2017-02-13 23:58:19.094436"], ["id", 2]]

  def destroy
    @user = User.find(params[:id])
    if @user.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 2]]