W5D1/GoalSetterApp/app/views/users/index.html.erb

<% Goal.all.each do |goal| %>
---
SELECT "goals".* FROM "goals"

    <%= goal.title %>
    <%= User.find(goal.user_id).username %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]