W5D1/GoalSetterApp/app/views/goals/index.html.erb

SELECT "goals".* FROM "goals"
---
<% Goal.all.each do |goal| %>