W4D2/Cats/app/controllers/cats_controller.rb

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    @cat = Cat.find_by_id(params[:id])

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT 1  [["id", 1]]
---
  def edit
    @cat = Cat.find_by_id(params[:id])

SELECT  "cats".* FROM "cats" WHERE "cats"."id" IS NULL LIMIT 1
INSERT INTO "cats" ("name", "birth_date", "color", "sex", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @cat = Cat.find_by_id(params[:id])
    if @cat
      redirect_to edit_cat_url(@cat)
    else
      @cat = Cat.create!(cat_params)

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "cats" SET "name" = $1, "sex" = $2, "description" = $3, "updated_at" = $4 WHERE "cats"."id" = $5  [["name", "Fido"], ["sex", "F"], ["description", "great"], ["updated_at", "2017-02-15 00:43:49.892259"], ["id", 1]]
---
  def update
    @cat = Cat.find_by_id(params[:id])
    if @cat
      @cat.update!(cat_params)